#+OPTIONS: ^:{}

Stuff for the Sac and Jane paper on turbulence diagnostics

*** New tables of structure function slopes
+ These have changed slightly since the previous draft
+ We only use times after 200,00 years
| Time        | 200,000 |      |      | 250,000 |      |      | 300,000 |      |      |               |
| Plane       |     x−y |  x−z |  y−z |     x−y |  x−z |  y−z |     x−y |  x−z |  y−z | AVERAGE       |
|-------------+---------+------+------+---------+------+------+---------+------+------+---------------|
| Hα          |    0.61 | 0.49 | 0.55 |    0.71 | 0.49 | 0.47 |    0.82 | 0.53 | 0.62 | 0.59 +/- 0.04 |
| [OIII]λ5007 |    0.68 | 0.77 | 0.70 |    0.83 | 0.71 | 0.57 |    1.02 | 0.61 | 0.73 | 0.74 +/- 0.04 |
| [NII]λ6584  |    0.53 | 0.38 | 0.45 |    0.61 | 0.43 | 0.41 |    0.65 | 0.53 | 0.44 | 0.49 +/- 0.03 |
| [SII]λ6716  |    0.39 | 0.28 | 0.32 |    0.39 | 0.28 | 0.26 |    0.40 | 0.41 | 0.26 | 0.33 +/- 0.02 |
#+TBLFM: $11=vmeane($2..$10); f2

**** DONE Mung all data into a big table
CLOSED: [2014-07-23 Wed 17:28]

#+name: extract-table
#+BEGIN_SRC python :return tab :results verbatim
  import json
  import numpy as np
  from astropy.table import Table

  views = ['xy', 'xz', 'yz']
  ions = ['halp', 'oiii', 'niix', 'siix', 'vion']
  lines = ['Halpha', 'O35007', 'N26584', 'S26716']

  binids = {'t': 'n032', 'T': 'n001'}

  results = {}
  columns = []
  for ion in ions:
      datafile = 'Power-Indices/3D/04052012_4_sp-{}-allfit.dat'.format(ion)
      times, k3d = np.loadtxt(datafile, usecols=(0, 4), unpack=True)
      if 't' in results:
          assert np.alltrue(times == results['t'])
      else:
          results['t'] = times
          columns.append('t')
      klabel = "_".join(['k3', ion[0].upper()])
      results[klabel] = k3d - 2.0
      columns.append(klabel)

  for ion, line in zip(ions[:-1], lines):
      for view in views:
          for tT, binid in binids.items():
              datafile = 'Power-Indices/' \
                         '{}/04052012_4_-sp-{}y-{}' \
                         'kfit-tab.dat'.format(view, binid, line)
              times, kvca = np.loadtxt(datafile, usecols=(0, 2), unpack=True)
              assert np.alltrue(times == results['t'])
              klabel = "".join(['kv', ion[0].upper(), tT, view])
              results[klabel] = kvca
              columns.append(klabel)

          datafile = 'Power-Indices/{}/04052012_4_{}-sfallfit.dat'.format(view, line)
          times, ksf = np.loadtxt(datafile, usecols=(0, 2), unpack=True)
          klabel = "".join(['ks', ion[0].upper(), view])
          results[klabel] = ksf
          columns.append(klabel)

  tab = Table(data=results, names=columns)
  tab.write('power-indices-vs-time.tab', format='ascii.tab')

#+END_SRC

#+RESULTS: extract-table
#+begin_example
 t     k3_H    k3_O    k3_N    k3_S  ... ksSxz    kvStyz    kvSTyz  ksSyz 
---- ------- ------- ------- ------- ... ------ --------- --------- ------
10.0 -3.5542 -3.8993 -2.4411 -2.3671 ... 0.4012  -1.90324 -1.993975 0.4523
11.0 -3.6413 -4.1279 -2.5538 -2.4154 ... 0.3447 -1.898838 -2.025668 0.4785
12.0 -3.3278 -3.8197 -2.5536 -2.4609 ... 0.3583 -1.954415 -2.120802 0.4667
13.0 -3.2569 -3.7877 -2.6925   -2.57 ... 0.3003 -1.810293  -1.96001 0.5195
14.0 -3.1404  -3.681 -2.7998 -2.6637 ... 0.2453 -1.737539 -1.923827 0.4134
15.0 -3.0544 -3.5216 -2.7767 -2.6313 ... 0.2633 -1.690619 -1.849246 0.4497
16.0 -3.0108 -3.4642 -2.7482 -2.6072 ...  0.255  -1.72312 -1.939087 0.4121
17.0 -3.0198  -3.483 -2.7795  -2.626 ... 0.2803 -1.692221  -1.85228 0.3539
18.0 -2.9295 -3.4211 -2.7144 -2.5929 ... 0.2899 -1.666025 -1.841816 0.3447
19.0 -2.8438 -3.3775 -2.6606 -2.5758 ... 0.2955  -1.67981 -1.806665 0.3359
20.0 -2.8162 -3.3462 -2.6547 -2.5706 ... 0.2774 -1.702789 -1.847767 0.3186
21.0 -2.8399 -3.3769 -2.6508 -2.5658 ... 0.2666 -1.704195 -1.844396 0.3056
22.0 -2.8374 -3.3242 -2.6624 -2.5775 ... 0.2224  -1.76931 -1.925681 0.2929
23.0 -2.8771 -3.3222 -2.6754 -2.5863 ... 0.2362  -1.76314 -1.933978 0.2755
24.0 -2.8784 -3.3163 -2.6901 -2.5963 ... 0.2657 -1.806039 -1.956009 0.2766
25.0 -2.8875  -3.294 -2.6855 -2.5741 ... 0.2781 -1.810989  -1.97014 0.2629
26.0 -2.9189 -3.3506 -2.7039 -2.5979 ...  0.292 -1.845024 -2.020894 0.2473
27.0 -2.9292 -3.3588 -2.7179 -2.6187 ... 0.2992 -1.839533 -1.991121 0.2482
28.0 -2.9401 -3.3405 -2.7153 -2.6051 ... 0.3253 -1.851696 -2.000542 0.2457
29.0 -2.9365 -3.3574  -2.727 -2.6234 ... 0.3763 -1.841143 -1.995638 0.2413
30.0 -2.9371 -3.2956 -2.7483 -2.6488 ...  0.409 -1.816146 -1.980373 0.2581
#+end_example
*** Velocity widths
All the n=128 PPV cubes have 1.2667 km/s channels

|   n |    dV |
|-----+-------|
| 128 |   1.3 |
|  64 |   2.5 |
|  32 |   5.1 |
|  16 |  10.1 |
|   8 |  20.3 |
|   4 |  40.5 |
|   2 |  81.1 |
|   1 | 162.1 |
#+TBLFM: $2=1.2667 (128/$1) ; f1
*** Halve resolution of PPV cube
#+BEGIN_SRC python :results output
  import numpy as np
  from astropy.io import fits
  
  def double_down(ppv):
      nv, ny, nx = ppv.shape
      return np.reshape(ppv, (nv/2, 2, ny, nx)).sum(axis=1)

  PREFIX = "04052012_4_0030-cube"
  def all_the_way(suffix):
      hdu, = fits.open("bigdata/{}-{}.fits".format(PREFIX, suffix))
      while hdu.data.shape[0] > 1:
          hdu.data = double_down(hdu.data)
          hdu.writeto("bigdata/{}-{:03d}.fits".format(suffix, hdu.data.shape[0]), clobber=True)

  cubes = ["y-Halpha", "n-Halpha", "y-O35007", "n-O35007", 
           "y-N26584", "n-N26584", "y-S26716", "n-S26716", ]
  for cube in cubes:
      all_the_way(cube)
#+END_SRC

#+RESULTS:
#+begin_example
WARNING: Overwriting existing file 'bigdata/y-Halpha-064.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-Halpha-032.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-Halpha-016.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-Halpha-008.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-Halpha-004.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-Halpha-002.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-Halpha-001.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-Halpha-064.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-Halpha-032.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-Halpha-016.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-Halpha-008.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-Halpha-004.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-Halpha-002.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-Halpha-001.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-O35007-064.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-O35007-032.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-O35007-016.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-O35007-008.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-O35007-004.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-O35007-002.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-O35007-001.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-O35007-064.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-O35007-032.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-O35007-016.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-O35007-008.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-O35007-004.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-O35007-002.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-O35007-001.fits'. [astropy.io.fits.hdu.hdulist]
#+end_example

*** Table of structure function indices
| Time        | 150,000 |      |      | 200,000 |      |      | 250,000 |      |      | 300,000 |      |      |               |
| Plane       |     x−y |  x−z |  y−z |     x−y |  x−z |  y−z |     x−y |  x−z |  y−z |     x−y |  x−z |  y−z | AVERAGE       |
|-------------+---------+------+------+---------+------+------+---------+------+------+---------+------+------+---------------|
| Hα          |    0.51 | 0.60 | 0.67 |    0.61 | 0.51 | 0.60 |    0.71 | 0.53 | 0.51 |    0.79 | 0.58 | 0.61 | 0.60 +/- 0.03 |
| [OIII]λ5007 |    0.69 | 0.77 | 0.87 |    0.68 | 0.78 | 0.70 |    0.83 | 0.73 | 0.59 |    1.02 | 0.63 | 0.74 | 0.75 +/- 0.03 |
| [NII]λ6584  |    0.46 | 0.54 | 0.58 |    0.54 | 0.44 | 0.56 |    0.60 | 0.48 | 0.55 |    0.66 | 0.63 | 0.53 | 0.55 +/- 0.02 |
| [SII]λ6716  |    0.41 | 0.44 | 0.50 |    0.44 | 0.37 | 0.47 |    0.45 | 0.43 | 0.48 |    0.43 | 0.47 | 0.48 | 0.45 +/- 0.01 |
#+TBLFM: $14=vmeane($2..$13); f2


Same, but without the 150,000 years 
| Time        | 200,000 |      |      | 250,000 |      |      | 300,000 |      |      |               |
| Plane       |     x−y |  x−z |  y−z |     x−y |  x−z |  y−z |     x−y |  x−z |  y−z | AVERAGE       |
|-------------+---------+------+------+---------+------+------+---------+------+------+---------------|
| Hα          |    0.61 | 0.51 | 0.60 |    0.71 | 0.53 | 0.51 |    0.79 | 0.58 | 0.61 | 0.61 +/- 0.03 |
| [OIII]λ5007 |    0.68 | 0.78 | 0.70 |    0.83 | 0.73 | 0.59 |    1.02 | 0.63 | 0.74 | 0.74 +/- 0.04 |
| [NII]λ6584  |    0.54 | 0.44 | 0.56 |    0.60 | 0.48 | 0.55 |    0.66 | 0.63 | 0.53 | 0.55 +/- 0.02 |
| [SII]λ6716  |    0.44 | 0.37 | 0.47 |    0.45 | 0.43 | 0.48 |    0.43 | 0.47 | 0.48 | 0.45 +/- 0.01 |
#+TBLFM: $11=vmeane($2..$10); f2




** Simulation [O III] slopes

| Time |          Thick |        Thin NB |         Thin B |
|------+----------------+----------------+----------------|
|   15 |          -3.47 |          -2.89 |          -3.13 |
|   20 |          -3.29 |          -2.63 |          -2.85 |
|   25 |          -3.40 |          -2.52 |          -2.74 |
|   30 |          -3.37 |          -2.41 |          -2.64 |
|------+----------------+----------------+----------------|
|   15 |          -3.14 |          -2.73 |          -3.01 |
|   20 |          -3.18 |          -2.55 |          -2.76 |
|   25 |          -3.31 |          -2.48 |          -2.69 |
|   30 |          -3.39 |          -2.46 |          -2.68 |
|------+----------------+----------------+----------------|
|   15 |          -3.42 |          -2.51 |          -2.71 |
|   20 |          -3.26 |          -2.51 |          -2.69 |
|   25 |          -3.34 |          -2.45 |          -2.69 |
|   30 |          -3.43 |          -2.58 |          -2.79 |
|------+----------------+----------------+----------------|
|      | -3.33 +/- 0.03 | -2.56 +/- 0.04 | -2.78 +/- 0.04 |
#+TBLFM: @14$2..@14$4=vmeane(@I..@IIII);f2


** Simulation [N II] slopes

| Time |          Thick |        Thin NB |         Thin B |  Thin - Thick |
|------+----------------+----------------+----------------+---------------|
|   15 |          -2.41 |          -2.13 |          -2.28 |          0.13 |
|   20 |          -2.61 |          -2.18 |          -2.36 |          0.25 |
|   25 |          -2.42 |          -2.13 |          -2.28 |          0.14 |
|   30 |          -2.58 |          -2.20 |          -2.35 |          0.23 |
|------+----------------+----------------+----------------+---------------|
|   15 |          -2.38 |          -2.05 |          -2.20 |          0.18 |
|   20 |          -2.48 |          -2.17 |          -2.31 |          0.17 |
|   25 |          -2.61 |          -2.22 |          -2.39 |          0.22 |
|   30 |          -2.52 |          -2.17 |          -2.33 |          0.19 |
|------+----------------+----------------+----------------+---------------|
|   15 |          -2.42 |          -2.16 |          -2.30 |          0.12 |
|   20 |          -2.44 |          -2.14 |          -2.29 |          0.15 |
|   25 |          -2.63 |          -2.22 |          -2.38 |          0.25 |
|   30 |          -2.66 |          -2.28 |          -2.45 |          0.21 |
|------+----------------+----------------+----------------+---------------|
|      | -2.51 +/- 0.03 | -2.17 +/- 0.02 | -2.33 +/- 0.02 | 0.18 +/- 0.04 |
#+TBLFM: $5=$4 - $2;f2::@14$2..@14$4=vmeane(@I..@IIII);f2

** Simulation [S II] slopes
| Time |          Thick |        Thin NB |         Thin B |  Thin - Thick |
|------+----------------+----------------+----------------+---------------|
|   15 |          -2.13 |          -1.76 |          -1.87 |          0.26 |
|   20 |          -2.03 |          -1.82 |          -1.89 |          0.14 |
|   25 |          -1.84 |          -1.69 |          -1.76 |          0.08 |
|   30 |          -1.85 |          -1.59 |          -1.66 |          0.19 |
|------+----------------+----------------+----------------+---------------|
|   15 |          -1.96 |          -1.61 |          -1.69 |          0.27 |
|   20 |          -1.82 |          -1.69 |          -1.74 |          0.08 |
|   25 |          -2.19 |          -1.96 |          -2.02 |          0.17 |
|   30 |          -1.92 |          -1.64 |          -1.71 |          0.21 |
|------+----------------+----------------+----------------+---------------|
|   15 |          -2.11 |          -1.90 |          -1.96 |          0.15 |
|   20 |          -2.04 |          -1.75 |          -1.86 |          0.18 |
|   25 |          -1.97 |          -1.76 |          -1.80 |          0.17 |
|   30 |          -1.96 |          -1.73 |          -1.78 |          0.18 |
|------+----------------+----------------+----------------+---------------|
|      | -1.99 +/- 0.03 | -1.74 +/- 0.03 | -1.81 +/- 0.03 | 0.18 +/- 0.04 |
#+TBLFM: $5=$4 - $2;f2::@14$2..@14$4=vmeane(@I..@IIII);f2



** Simulation H\alpha slopes

| Time |          Thick |        Thin NB |         Thin B |  Thin - Thick |
|------+----------------+----------------+----------------+---------------|
|   15 |          -2.65 |          -2.54 |          -2.67 |         -0.02 |
|   20 |          -2.63 |          -2.41 |          -2.58 |          0.05 |
|   25 |          -2.61 |          -2.31 |          -2.48 |          0.13 |
|   30 |          -2.56 |          -2.23 |          -2.37 |          0.19 |
|------+----------------+----------------+----------------+---------------|
|   15 |          -2.52 |          -2.49 |          -2.63 |         -0.11 |
|   20 |          -2.55 |          -2.35 |          -2.51 |          0.04 |
|   25 |          -2.60 |          -2.29 |          -2.45 |          0.15 |
|   30 |          -2.53 |          -2.23 |          -2.39 |          0.14 |
|------+----------------+----------------+----------------+---------------|
|   15 |          -2.66 |          -2.40 |          -2.64 |          0.02 |
|   20 |          -2.49 |          -2.26 |          -2.42 |          0.07 |
|   25 |          -2.62 |          -2.29 |          -2.50 |          0.12 |
|   30 |          -2.66 |          -2.35 |          -2.48 |          0.18 |
|------+----------------+----------------+----------------+---------------|
|      | -2.59 +/- 0.02 | -2.35 +/- 0.03 | -2.51 +/- 0.03 | 0.08 +/- 0.04 |
#+TBLFM: $5=$4 - $2;f2::@14$2..@14$4=vmeane(@I..@IIII);f2

